/* Техническое задание

Напиши программу, которая будет собирать статистику из пользовательских данных.

Массив с данными записан в переменную usersData.

Найди все элементы массива с данными, в которых содержится определённая строка. Эта искомая строка записана в переменную query.

Количество подходящих элементов (пользователей), которые подходят под критерий, запиши в переменную matchingUsers.

Чтобы проверить наличие строки в элементе массива, используй команду indexOf().

*/

let usersData = [
  "Виталий Иванович",
  "Иннокентий Петрович",
  "Александр Александрович",
  "Игорь Олегович",
  "Евгений Петрович",
  "Игнат Денисович",
  "Сергей Александрович",
  "Семён Петрович",
];
let query = "Александрович";
let matchingUsers = 0;

for (let i = 0; i < usersData.length; i++) {
  if (usersData[i].indexOf(query) !== -1) {
    matchingUsers++;
  }
}
