/* Техническое задание

Мяу! Выручай! Мне нужно посчитать, каким способом я доберусь быстрее всего.

Средняя скорость транспорта находится в переменной averageSpeed
 и записана в километрах в час.

Расстояние записано в переменную routeDistance и указано в милях. 
Поэтому сначала нужно перевести его в километры.

В одной миле содержится 1.6 километров.

Посчитай сколько времени займёт поездка и запиши результат в переменную routeTime.

Округляй результат с помощью Math.round.

*/

let routeDistance = 78;
let averageSpeed = 80;


let routeTime = Math.round(routeDistance * 1.6 / averageSpeed);